docs/guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KVOS Guides</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css">
<link rel="stylesheet" href="./stylesheets/toc.css">
</head>
<body>
<div id="content" class="content">
<div class="nav" id="nav">
    <a href="javascript:void(0);" onclick="myFunction()" class="menuicon"><b>MENU</b></a>
    <a href="./index.html">Home</a>
    <a href="./screenshots.html">Screenshots</a>
    <a href="./installation.html">Install KVOS</a>
    <a href="./guide.html" class="current">Guide</a>
    <a href="./software.html">Pre-Installed</a>
</div>

<div id="outline-container-org14ab751" class="outline-2">
<h2 id="org14ab751">After KVOS installation</h2>
<div class="outline-text-2" id="text-org14ab751">
</div>
<div id="outline-container-orgc4dfaf5" class="outline-3">
<h3 id="orgc4dfaf5">Package cache cleaning</h3>
<div class="outline-text-3" id="text-orgc4dfaf5">
<ul class="org-ul">
<li><a href="https://wiki.archlinux.org/title/pacman#Cleaning_the_package_cache">Reference: Archwiki Guide to package cachhe cleaning</a></li>
</ul>
<p>
Pacman stores it downloaded packages in <code>/var/cache/pacman/pkg</code> and does not remove old versions automatically. This can cause this directory to grow very large, very fast. To keep the system clean, install the <code>pacman-contrib</code> package, and then
</p>
<div class="org-src-container">
<pre class="src src-shell">doas paccache -r
</pre>
</div>
<p>
This will delete all cached versions of installed and uninstalled packages, except for the most recent three.
To specify how many recent versions you want to keep, use (<code>-rk1</code> will keep only one previous generation)
</p>
<div class="org-src-container">
<pre class="src src-shell">doas paccache -rk1
</pre>
</div>
<p>
To limit the action of <code>paccache</code> to uninstalled packages only, add the <code>-u</code> flag.
</p>
<div class="org-src-container">
<pre class="src src-shell">doas paccache -ruk0
</pre>
</div>
</div>
<div id="outline-container-org5b1e726" class="outline-4">
<h4 id="org5b1e726">Inbuilt pacman actions</h4>
<div class="outline-text-4" id="text-org5b1e726">
<p>
Pacman also has some built-in options to clean the cache and the leftover database files from repositories which are no longer listed in the configuration file <code>/etc/pacman.conf</code>
To remove all the cached packages that are not currently installed, and the unused sync database, execute:
</p>
<div class="org-src-container">
<pre class="src src-shell">doas pacman -Sc
</pre>
</div>
<p>
To remove all files from the cache, use the clean switch twice, this is the most aggressive approach and will leave nothing in the cache directory:
</p>
<div class="org-src-container">
<pre class="src src-shell">doas pacman -Scc
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcc4f919" class="outline-3">
<h3 id="orgcc4f919">Changing keyboard and display brightness</h3>
<div class="outline-text-3" id="text-orgcc4f919">
<p>
Only root can change the brightness by editing files in <code>/sys/class/backlight</code>. To allow users in the video group to change the brightness, a udev rule such as the following can be used (a sample <code>/etc/udev/rules.d/98-backlight.rules</code> file)
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5a5b5a;"># </span><span style="color: #5a5b5a;">allow screen brightness control for everyone</span>
<span style="color: #cc6666;">ACTION</span>==<span style="color: #b5bd68;">"add"</span>, <span style="color: #cc6666;">SUBSYSTEM</span>==<span style="color: #b5bd68;">"backlight"</span>, <span style="color: #cc6666;">RUN</span>+=<span style="color: #b5bd68;">"/bin/chgrp video </span><span style="color: #de935f;">$</span><span style="color: #cc6666;">sys</span><span style="color: #b5bd68;">$devpath/brightness"</span>, <span style="color: #cc6666;">RUN</span>+=<span style="color: #b5bd68;">"/bin/chmod g+w </span><span style="color: #de935f;">$</span><span style="color: #cc6666;">sys</span><span style="color: #b5bd68;">$devpath/brightness"</span>
</pre>
</div>
<p>
Make sure the user is in <code>video</code> group. If you used <a href="static/scripts/configuration-script.sh">my arch install script</a> then user will be in the <code>video</code> group.
</p>

<p>
To change keyboard brightness, following udev rule can be used (a sample <code>/etc/udev/rules.d/99-asus.rules</code> file):
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #5a5b5a;"># </span><span style="color: #5a5b5a;">allow keyboard brightness control for everyone</span>
<span style="color: #cc6666;">ACTION</span>==<span style="color: #b5bd68;">"add"</span>, <span style="color: #cc6666;">SUBSYSTEM</span>==<span style="color: #b5bd68;">"leds"</span>, <span style="color: #cc6666;">KERNEL</span>==<span style="color: #b5bd68;">"asus::kbd_backlight"</span>, <span style="color: #cc6666;">RUN</span>+=<span style="color: #b5bd68;">"/bin/chmod a+w /sys/class/leds/%k/brightness"</span>
</pre>
</div>
<p>
Again change <code>KERNEL==</code> with appropriate entry from <code>ls /sys/class/leds</code>.
</p>
</div>

<div id="outline-container-org46d0bcd" class="outline-4">
<h4 id="org46d0bcd">References</h4>
<div class="outline-text-4" id="text-org46d0bcd">
<ul class="org-ul">
<li><a href="https://wiki.archlinux.org/title/backlight#ACPI">ArchWiki</a></li>
<li><a href="https://superuser.com/a/1393488">Writing to file /sys/class/backlight/&lt;vendor&gt;/brightness</a></li>
<li><a href="https://unix.stackexchange.com/a/593121">How to set permissions in /sys permanently?</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7b1f5ba" class="outline-3">
<h3 id="org7b1f5ba">Using Wacom</h3>
<div class="outline-text-3" id="text-org7b1f5ba">
</div>
<div id="outline-container-org8e73949" class="outline-4">
<h4 id="org8e73949">Install the driver</h4>
<div class="outline-text-4" id="text-org8e73949">
<div class="org-src-container">
<pre class="src src-shell">pacman -S xf86-input-wacom
</pre>
</div>
<p>
This provides xsetwacom command.
</p>
</div>
</div>
<div id="outline-container-org1c06716" class="outline-4">
<h4 id="org1c06716">Mapping the tablet to a display (for multi-monitor)</h4>
<div class="outline-text-4" id="text-org1c06716">
<p>
First list the wacom devices using the command
</p>
<div class="org-src-container">
<pre class="src src-shell">xsetwacom list devices
</pre>
</div>
<p>
A sample output is
</p>
<pre class="example">
# Wacom One by Wacom S Pen stylus 	id: 15	type: STYLUS
# Wacom One by Wacom S Pen eraser 	id: 23	type: ERASER
</pre>
<p>
To map wacom tablet with ID 15 to display named HDMI-1, use following command
</p>
<div class="org-src-container">
<pre class="src src-shell">xsetwacom --set <span style="color: #b5bd68;">"15"</span> MapToOutput HDMI-1
</pre>
</div>
<p>
Sometimes output names &ldquo;HEAD-0&rdquo; and &ldquo;HEAD-1&rdquo; have to be used insted of HDMI-1
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6)</p>
</div>
</body>
</html>
